h1 Александр Кострыгин - "Компьютерная игра InGavench"

### Группа: 10 - МИ - 5
### Электронная почта: kosashik@gmail.com
### VK: www.vk.com/blackingrus


**[ НАЗВАНИЕ ПРОЕКТА ]**
Компьютерная игра "InGavench"


**[ ПРОБЛЕМНОЕ ПОЛЕ ]**
Через этот проект я хочу показать минусы нашего мира насилие, перенаселение, глобальное потепление и т.д. в виде юморестической истории одного героя
**[ ЗАКАЗЧИК / ПОТЕНЦИАЛЬНАЯ АУДИТОРИЯ ]**
Компания "CyberTek"
**[ АППАРАТНЫЕ ТРЕБОВАНИЯ ]** 
* Процессор Intel Core 2 Duo E6300
* 3 гб оперативной памяти 
* видеокарта gtx 970,
* 10 гб свободного дискового пространства.
**[ ФУНКЦИОНАЛЬНЫЕ ТРЕБОВАНИЯ ]**
Движение персонажей, введение диалогов, которые будут менять сюжет, использование способностей, повышение уровня персонажа, ипользование предметов, создание брони и оружие, убийство существ.
**[ ПОХОЖИЕ / АНАЛОГИЧНЫЕ ПРОДУКТЫ ]**
* Diablo  
*Плюсы:
Большая ветвь развития персонажа.
Хороший баланс монстров и предметов. 
*Минусы: 
Однообразность
**[ ИНСТРУМЕНТЫ РАЗРАБОТКИ ]**
* Движок unreal engine 4 .
* Среда разработки Microsoft Visual Studio .
* 3Dmax для создания моделей и текстур.
**[ ЭТАПЫ РАЗРАБОТКИ ]**
* Написание сюжета игры. 
* Продумывание баланса между монстрами,персонажем,предметами и способностями. 
* Написание "голого" кода и тестирование его. 
* Рисовка моделей и текстур. 
* Тестирования beta версии игры. 
* Исправление багов. 
* Выкладывание игры на игровую платформу Steam.
**[ ВОЗМОЖНЫЕ РИСКИ ]**
* Непопулярность данного продукта. 
* Недостаток времени на написании полного замысла проекта.
* Недостаток опыта для написания некоторых задуманных возможностей проекта.
